# ExternalDefinitions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalDefinitions Properties
ExternalDefinitions Class See Also
---
The ExternalDefinitions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Identifies if the definitions collection is empty. (Inherited from Definitions.) |
| Item | Retrieves a definition by a given name. (Inherited from Definitions.) |
| Size | The number of definitions in the collection. (Inherited from Definitions.) |

# See Also
ExternalDefinitions Class
Autodesk.Revit.DB Namespace